//------------------------------------------------------------------------------------------
// File : QuadRenderer.fx
// Desc : Quad Renderer Module.
// Copyright(c) Project Asura. All right reserved.
//------------------------------------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////////////////
// VSInput structure
////////////////////////////////////////////////////////////////////////////////////////////
struct VSInput
{
    float3 Position : POSITION;     //!< 位置座標です.
    float2 TexCoord : TEXCOORD;     //!< テクスチャ座標です.
};

////////////////////////////////////////////////////////////////////////////////////////////
// VSOutput structure
////////////////////////////////////////////////////////////////////////////////////////////
struct VSOutput
{
    float4 Position : SV_POSITION;  //!< 位置座標です.
    float2 TexCoord : TEXCOORD0;    //!< テクスチャ座標です.
};

////////////////////////////////////////////////////////////////////////////////////////////
// PSOutput structure
////////////////////////////////////////////////////////////////////////////////////////////
struct PSOutput
{
    float4 Color0 : SV_TARGET0;     //!< 出力カラーです.
};

////////////////////////////////////////////////////////////////////////////////////////////
// TransformParam Buffer
////////////////////////////////////////////////////////////////////////////////////////////
cbuffer TransformParam : register( b0 )
{
    float4x4 ScaleOffset : packoffset( c0 );      //!< スケールオフセット行列です.
    float    ArrayIndex  : packoffset( c4 );
};

////////////////////////////////////////////////////////////////////////////////////////////
// Textures and Samplers
////////////////////////////////////////////////////////////////////////////////////////////
Texture2D               DecalMap : register( t0 );      //!< デカールテクスチャです.
SamplerState            DecalSmp : register( s0 );      //!< デカールテクスチャのサンプラーです.


//------------------------------------------------------------------------------------------
//! @brief      頂点シェーダのメインエントリーポイントです.
//------------------------------------------------------------------------------------------
VSOutput VSFunc( VSInput input )
{
    VSOutput output = (VSOutput)0;

    float4 localPos = float4( input.Position, 1.0f );
    float4 pos = mul( ScaleOffset, localPos );      // スケール変換 + 平行移動.

    output.Position = pos;
    output.TexCoord = input.TexCoord;

    return output;
}

//------------------------------------------------------------------------------------------
//! @brief      ピクセルシェーダのメインエントリーポイントです.
//------------------------------------------------------------------------------------------
PSOutput PSFunc( VSOutput input )
{
    PSOutput output = (PSOutput)0;

    output.Color0 = DecalMap.Sample( DecalSmp, input.TexCoord ).xxxx;

    return output;
}

