//-----------------------------------------------------------------------------------------
// File : ShadowVS.hlsl
// Desc : Generate Shadow Map. 
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////////////////
// VSInput structure
///////////////////////////////////////////////////////////////////////////////////////////
struct VSInput
{
    float3  Position    : POSITION;         //!< 位置座標です(ローカル座標系).
    float3  Normal      : NORMAL;           //!< 法線ベクトルです(ローカル座標系).
    float3  Tangent     : TANGENT;          //!< 接ベクトルです(ローカル座標系).
    float2  TexCoord    : TEXCOORD;         //!< テクスチャ座標です.
};

///////////////////////////////////////////////////////////////////////////////////////////
// VSOutput structure
///////////////////////////////////////////////////////////////////////////////////////////
struct VSOutput
{
    float4  Position : SV_POSITION;         //!< 位置座標です(ビュー射影空間).
};

///////////////////////////////////////////////////////////////////////////////////////////
// CBMatrix buffer
///////////////////////////////////////////////////////////////////////////////////////////
cbuffer CBMatrix : register( b1 )
{
    float4x4    World       : packoffset( c0 );     //!< ワールド行列です.
    float4x4    ViewProj    : packoffset( c4 );     //!< ビュー射影行列です.
};


//-----------------------------------------------------------------------------------------
//! @brief      頂点シェーダメインエントリーポイントです.
//-----------------------------------------------------------------------------------------
VSOutput VSFunc( VSInput input )
{
    VSOutput output = (VSOutput)0;

    float4 localPos    = float4( input.Position, 1.0f );
    float4 worldPos    = mul( World,    localPos );
    float4 viewProjPos = mul( ViewProj, worldPos );

    output.Position = viewProjPos;

    return output;
}

/* この頂点シェーダに対応するピクセルシェーダはありません.*/
